from pathlib import Path

ADS_DIR = Path(__file__).parent / "ads"

ADS = [
    {
        "image": ADS_DIR / "ad1.jpg",
        "caption": (
            "🏙 PRIDE — нерухомість із характером\n"
            "🍁🍁🍁\n"
            "Шукаєш квартиру, будинок або вигідну інвестицію?\n"
            "У PRIDE ми підбираємо не просто квадратні метри — "
            "ми знаходимо простір для життя та зростання.\n\n"
            "🔑 Купівля та продаж нерухомості\n"
            "📍 Актуальні й перевірені об’єкти\n"
            "📊 Чесна аналітика та повний супровід угоди\n"
            "🤝 Індивідуальний підхід без тиску\n\n"
            "🟥🟥‼️‼️❗️❗️❗️\n"
            "🎁 Бонус для  AUDI Club UA :\n"
            "За промокодом AUDIKV — знижка 150$ на послуги нотаріуса 💸\n\n"
            "Телефонуйте за номером або пишіть у telegram\n"
            "📱 +380730731483\n"
            "(Обов'язково скиньте промо-код!)\n"
            "Либо к @tchktoo"
        ),
    },
    {
        "image": ADS_DIR / "ad3.jpg",
        "caption": (
            "Встановлення ambient light під ключ\n"
            "✔️Створення гарного інтер'єру\n"
            "✔️Встановлення триває всього декілька годин\n"
            "✔️ Регулювання яскравості та кольору\n"
            "✔️ Безліч режимів роботи\n\n"
            "Встановлення шумо-віброізоляції під ключ\n"
            "✔️Зменшення шуму та вібрацій у салоні\n"
            "✔️Комфортні поїздки без зайвих звуків\n"
            "✔️Покращення акустики та теплоізоляції\n"
            "✔️Якісні матеріали та професійний монтаж\n\n"
            "🚘Audi: (a4/5 b9, a6/7 c7)\n"
            "🚘Volkswagen: (Jetta, Passat, Golf)\n\n"
            "📌м.Київ\n"
            "📩Всі деталі - @kulibin8\n"
            "📷Instagram: https://www.instagram.com/kulibin.ambient?igsh=d3pobHFpNW1mNjBm&amp;utm_source=qr\n"
            "🎵TikTok: www.tiktok.com/@kulibin.ambient\n\n"
            "💸Знижка по промокоду «audi club» 5%"
        ),
    },
    {
        "image": ADS_DIR / "ad2.jpg",
        "caption": (
            "🚗 DRACAR — автозапчастини для вашого авто\n"
            "Замовлення з доставкою по всій Україні або самовивіз із точки видачі:\n"
            "📍 м. Київ, вул. Межигірська, 87А\n\n"
            "Для швидкого замовлення — @daniilkushnirchuk\n"
            "📞 (093) 121-24-32 | (050) 614-00-65\n"
            "🌐 dracar.kyiv.ua\n"
            "💸 Знижка по промокоду «audi club ua» від 10%"
        ),
    },
]
