from pathlib import Path

ADS_DIR = Path(__file__).parent / "ads"

ADS = [
    {
        "image": ADS_DIR / "ad1.jpg",
        "caption": (
            "🏙 PRIDE — нерухомість із характером\n"
            "🍁🍁🍁\n"
            "Шукаєш квартиру, будинок або вигідну інвестицію?\n"
            "У PRIDE ми підбираємо не просто квадратні метри — "
            "ми знаходимо простір для життя та зростання.\n\n"
            "🔑 Купівля та продаж нерухомості\n"
            "📍 Актуальні й перевірені об’єкти\n"
            "📊 Чесна аналітика та повний супровід угоди\n"
            "🤝 Індивідуальний підхід без тиску\n\n"
            "🟥🟥‼️‼️❗️❗️❗️\n"
            "🎁 Бонус для  AUDI Club UA :\n"
            "За промокодом AUDIKV — знижка 150$ на послуги нотаріуса 💸\n\n"
            "Телефонуйте за номером або пишіть у telegram\n"
            "📱 +380730731483\n"
            "(Обов'язково скиньте промо-код!)\n"
            "Либо к @tchktoo"
        ),
    },
    {
        "image": ADS_DIR / "ad2.jpg",
        "caption": (
            "🚗 DRACAR — автозапчастини для вашого авто\n"
            "Замовлення з доставкою по всій Україні або самовивіз із точки видачі:\n"
            "📍 м. Київ, вул. Межигірська, 87А\n\n"
            "Для швидкого замовлення — @daniilkushnirchuk\n"
            "📞 (093) 121-24-32 | (050) 614-00-65\n"
            "🌐 dracar.kyiv.ua\n"
            "💸 Знижка по промокоду «audi club ua» від 10%"
        ),
    },
    {
        "image": ADS_DIR / "ad4.jpg",
        "caption": (
            "Чекаємо @audi_club_u_a до стін сервісу\n"
            "«unlim.service»за якісним ремонтом та "
            "найкращими цінами!\n\n"
            "А за промокодом «AUDI_T.O.» ви отримаєте \n"
            "7% знижки на роботи 😉🤘🏻\n\n"
            "📍 Київ, Велика кільцева 4г\n"
            "🗺 Карта: https://maps.app.goo.gl/FBUqTQun3EXPUpVt7?g_st=ic\n\n"
            "📲 0631490527\n"
            "📲 Михайло\n"
            "Instagram:\n\n"
            "https://www.instagram.com/unlim.service?igsh=MWc1Z2FuZWFrbHhxMw==\n\n"
        ),
    },
]
